<!-- attach-outputs:plan-nodes-prod.txt -->
  <!-- Output: plan-nodes-prod.txt -->
  #### plan-nodes-prod.txt 📖: `test: success, prod: success`

  **Last updated:** Jan 19, 2026, 04:54 PM UTC

  <details><summary>Show Contents</summary>

  ```

  
Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.cluster.module.talos-vm["tiles-cp-1"].proxmox_virtual_environment_vm.main has changed
  ~ resource "proxmox_virtual_environment_vm" "main" {
        id                                   = "7211"
      ~ ipv4_addresses                       = [
            # (6 unchanged elements hidden)
            [],
          ~ [
                "10.0.128.11",
              + "10.0.128.10",
            ],
        ]
      ~ mac_addresses                        = [
            "00:00:00:00:00:00",
          ~ "C6:43:DE:18:54:53" -> "D2:66:BA:F9:CC:A1",
          ~ "5E:D6:18:BE:CA:EE" -> "FE:4F:C6:EE:96:37",
            "00:00:00:00:00:00",
            # (4 unchanged elements hidden)
        ]
        name                                 = "tiles-cp-1"
        tags                                 = []
        # (32 unchanged attributes hidden)

      ~ cpu {
          + flags        = []
            # (9 unchanged attributes hidden)
        }

        # (6 unchanged blocks hidden)
    }

  # module.cluster.module.talos-vm["tiles-cp-2"].proxmox_virtual_environment_vm.main has changed
  ~ resource "proxmox_virtual_environment_vm" "main" {
        id                                   = "7212"
      ~ mac_addresses                        = [
            "00:00:00:00:00:00",
          ~ "42:D1:FB:70:78:50" -> "42:D2:FA:B7:76:9B",
          ~ "76:8A:84:E8:FB:11" -> "2E:4C:02:E6:26:B7",
            "00:00:00:00:00:00",
            # (4 unchanged elements hidden)
        ]
        name                                 = "tiles-cp-2"
        tags                                 = []
        # (33 unchanged attributes hidden)

      ~ cpu {
          + flags        = []
            # (9 unchanged attributes hidden)
        }

        # (6 unchanged blocks hidden)
    }

  # module.cluster.module.talos-vm["tiles-cp-3"].proxmox_virtual_environment_vm.main has changed
  ~ resource "proxmox_virtual_environment_vm" "main" {
        id                                   = "7213"
      ~ mac_addresses                        = [
            "00:00:00:00:00:00",
          ~ "0E:0D:59:A8:38:61" -> "46:91:B2:7A:B9:04",
          ~ "16:6A:87:0E:03:16" -> "5E:F5:A7:48:BF:67",
            "00:00:00:00:00:00",
            # (4 unchanged elements hidden)
        ]
        name                                 = "tiles-cp-3"
        tags                                 = []
        # (33 unchanged attributes hidden)

      ~ cpu {
          + flags        = []
            # (9 unchanged attributes hidden)
        }

        # (6 unchanged blocks hidden)
    }

  # module.cluster.module.talos-vm["tiles-wk-1"].proxmox_virtual_environment_vm.main has changed
  ~ resource "proxmox_virtual_environment_vm" "main" {
        id                                   = "7221"
      ~ mac_addresses                        = [
            "00:00:00:00:00:00",
          ~ "FA:04:89:61:92:9E" -> "B2:33:71:EC:8E:77",
          ~ "AE:0B:22:38:CE:85" -> "EE:39:16:2A:FA:49",
            "00:00:00:00:00:00",
            # (4 unchanged elements hidden)
        ]
        name                                 = "tiles-wk-1"
        tags                                 = []
        # (33 unchanged attributes hidden)

      ~ cpu {
          + flags        = []
            # (9 unchanged attributes hidden)
        }

        # (6 unchanged blocks hidden)
    }

  # module.cluster.module.talos-vm["tiles-wk-2"].proxmox_virtual_environment_vm.main has changed
  ~ resource "proxmox_virtual_environment_vm" "main" {
        id                                   = "7222"
      ~ mac_addresses                        = [
            "00:00:00:00:00:00",
          ~ "9E:94:10:71:83:66" -> "EA:34:3E:F5:A3:BE",
          ~ "AA:46:3F:EB:1F:12" -> "7E:89:08:DA:49:11",
            "00:00:00:00:00:00",
            # (4 unchanged elements hidden)
        ]
        name                                 = "tiles-wk-2"
        tags                                 = []
        # (33 unchanged attributes hidden)

      ~ cpu {
          + flags        = []
            # (9 unchanged attributes hidden)
        }

        # (6 unchanged blocks hidden)
    }

  # module.cluster.module.talos-vm["tiles-wk-3"].proxmox_virtual_environment_vm.main has changed
  ~ resource "proxmox_virtual_environment_vm" "main" {
        id                                   = "7223"
      ~ mac_addresses                        = [
            "00:00:00:00:00:00",
          ~ "3A:3F:7B:C4:70:F3" -> "16:EF:73:A8:85:2A",
          ~ "CA:5A:E7:7F:BB:17" -> "7A:3E:87:7D:F8:32",
            "00:00:00:00:00:00",
            # (4 unchanged elements hidden)
        ]
        name                                 = "tiles-wk-3"
        tags                                 = []
        # (33 unchanged attributes hidden)

      ~ cpu {
          + flags        = []
            # (9 unchanged attributes hidden)
        }

        # (6 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # synology_container_project.alloy[0] will be created
  + resource "synology_container_project" "alloy" {
      + configs    = {
          + "alloy_config" = {
              + content = <<-EOT
                    // Alloy configuration for Synology host monitoring
                    // Collects node_exporter metrics and system logs, forwarding to OTLP endpoints
                    
                    // Node exporter for host metrics
                    prometheus.exporter.unix "node" {
                      include_mount_points = true
                      include_rapl         = false
                      include_softnet      = true
                      include_textfile     = false
                      include_time         = true
                      include_timex        = true
                      include_vmstat       = true
                      include_zoneinfo     = false
                    
                      procfs_path = "/host/proc"
                      sysfs_path  = "/host/sys"
                      rootfs_path = "/host"
                    }
                    
                    // OTLP HTTP exporter for tiles-test cluster
                    otelcol.exporter.otlphttp "tiles_test" {
                      client {
                        endpoint = "https://otlp.tiles-test.symmatree.com"
                        headers = {
                          "X-Scope-OrgID" = "tiles-test"
                        }
                      }
                    }
                    
                    // OTLP HTTP exporter for tiles cluster
                    otelcol.exporter.otlphttp "tiles" {
                      client {
                        endpoint = "https://otlp.tiles.symmatree.com"
                        headers = {
                          "X-Scope-OrgID" = "tiles"
                        }
                      }
                    }
                    
                    // Scrape node exporter metrics and convert to OTLP format
                    prometheus.scrape "node" {
                      targets    = prometheus.exporter.unix.node.targets
                      forward_to = [
                        otelcol.receiver.prometheus.tiles_test.receiver,
                        otelcol.receiver.prometheus.tiles.receiver,
                      ]
                    }
                    
                    // Convert Prometheus to OTLP for tiles-test
                    otelcol.receiver.prometheus "tiles_test" {
                      output {
                        metrics = [otelcol.exporter.otlphttp.tiles_test.input]
                      }
                    }
                    
                    // Convert Prometheus to OTLP for tiles
                    otelcol.receiver.prometheus "tiles" {
                      output {
                        metrics = [otelcol.exporter.otlphttp.tiles.input]
                      }
                    }
                    
                    // Log collection from host
                    // Note: Synology DSM uses traditional syslog (not systemd/journalctl)
                    // Synology does not use systemd, so journalctl is not available
                    // We collect from:
                    // - /var/log/messages: Traditional syslog (all system messages)
                    // - /var/log/synolog/*.log: Synology's custom application logs
                    loki.source.file "syslog" {
                      targets = [
                        {
                          __path__ = "/host/var/log/messages",
                          job      = "synology-syslog",
                          host     = "raconteur",
                        },
                        {
                          __path__ = "/host/var/log/synolog/*.log",
                          job      = "synology-synolog",
                          host     = "raconteur",
                        },
                        // Additional common log locations
                        {
                          __path__ = "/host/var/log/auth.log",
                          job      = "synology-auth",
                          host     = "raconteur",
                        },
                        {
                          __path__ = "/host/var/log/daemon.log",
                          job      = "synology-daemon",
                          host     = "raconteur",
                        },
                      ]
                      forward_to = [
                        loki.write.tiles_test.receiver,
                        loki.write.tiles.receiver,
                      ]
                    }
                    
                    // Loki write for tiles-test
                    loki.write "tiles_test" {
                      endpoint {
                        url = "https://otlp.tiles-test.symmatree.com/loki/api/v1/push"
                      }
                      external_labels = {
                        cluster = "tiles-test"
                        host    = "raconteur"
                      }
                    }
                    
                    // Loki write for tiles
                    loki.write "tiles" {
                      endpoint {
                        url = "https://otlp.tiles.symmatree.com/loki/api/v1/push"
                      }
                      external_labels = {
                        cluster = "tiles"
                        host    = "raconteur"
                      }
                    }
                EOT
              + file    = "alloy_config"
              + name    = "alloy_config"
            },
        }
      + content    = <<-EOT
            services:
              alloy:
                configs:
                  - source: alloy_config
                    target: /etc/alloy/config.alloy
                deploy:
                  replicas: 1
                environment:
                  HOSTNAME: raconteur
                image: grafana/alloy:latest
                mem_limit: "536870912"
                network_mode: host
                pid: host
                restart: unless-stopped
                volumes:
                  - type: bind
                    source: /
                    target: /host
                    read_only: true
                    bind:
                      propagation: rslave
            configs:
              alloy_config:
                name: alloy_config
                file: alloy_config
        EOT
      + created_at = (known after apply)
      + id         = (known after apply)
      + metadata   = (known after apply)
      + name       = "alloy"
      + run        = true
      + services   = {
          + "alloy" = {
              + configs      = [
                  + {
                      + source = "alloy_config"
                      + target = "/etc/alloy/config.alloy"
                    },
                ]
              + environment  = {
                  + "HOSTNAME" = "raconteur"
                }
              + image        = "grafana/alloy:latest"
              + mem_limit    = "512M"
              + network_mode = "host"
              + pid          = "host"
              + restart      = "unless-stopped"
              + volumes      = [
                  + {
                      + bind      = {
                          + propagation = "rslave"
                        }
                      + read_only = true
                      + source    = "/"
                      + target    = "/host"
                      + type      = "bind"
                    },
                ]
            },
        }
      + share_path = "/docker/alloy"
      + status     = (known after apply)
      + updated_at = (known after apply)
    }

  # module.cluster.module.talos-amd-metal["lancer"].talos_machine_configuration_apply.this will be created
  + resource "talos_machine_configuration_apply" "this" {
      + apply_mode                  = "auto"
      + client_configuration        = (sensitive value)
      + config_patches              = [
          + <<-EOT
                version: v1alpha1
                cluster:
                  network:
                    # cilium will become our CNI.
                    cni:
                      name: none
                  controllerManager:
                    extraArgs:
                      # Listen to more than localhost so we can scrape from Alloy.
                      bind-address: 0.0.0.0
                  scheduler:
                    extraArgs:
                      # Listen to more than localhost so we can scrape from Alloy.
                      bind-address: 0.0.0.0
                  apiServer:
                    extraArgs:
                      # Listen to more than localhost so we can scrape from Alloy.
                      bind-address: 0.0.0.0
                  proxy:
                    # Cilium will replace the proxy
                    disabled: true
                machine:
                  sysctls:
                    user.max_user_namespaces: "8192"
                  # https://www.talos.dev/v1.10/talos-guides/configuration/containerd/#exposing-metrics
                  files:
                    - content: |
                        [metrics]
                          address = "0.0.0.0:11234"
                      path: /etc/cri/conf.d/20-customization.part
                      op: create
                  features:
                    rbac: true
                    diskQuotaSupport: true
                    hostDNS:
                      enabled: true
                      resolveMemberNames: true
                      forwardKubeDNSToHost: false
                    imageCache:
                      localEnabled: true
                  install:
                    # wipe: true
                    # extraKernelArgs are set in the schematic customization, not here
                    # Setting them here conflicts with grubUseUKICmdline when using schematics
            EOT,
          + <<-EOT
                "cluster":
                  "clusterName": "tiles"
                  "network":
                    "podSubnets":
                    - "10.0.144.0/20"
                    "serviceSubnets":
                    - "10.0.136.0/21"
                "version": "v1alpha1"
            EOT,
          + <<-EOT
                "machine":
                  "install":
                    "image": "factory.talos.dev/installer/f1f0cdb658dc249b04cc063fc997f5826558fe37f7927923d73bfe519af954ab:v1.12.0"
            EOT,
          + <<-EOT
                "machine":
                  "kubelet":
                    "extraArgs":
                      "register-with-taints": "dedicated=nodeodm:NoSchedule"
            EOT,
        ]
      + endpoint                    = "10.0.128.51"
      + id                          = (known after apply)
      + machine_configuration       = (sensitive value)
      + machine_configuration_input = (sensitive value)
      + node                        = "10.0.128.51"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

  ```

  </details>
  
  